src/cf/InformationRegisters/ВесИОбъемЕдиницТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВесИОбъемЕдиницТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Вес</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ВесИОбъемЕдиницТоваров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Значения(Номенклатура, ЕдиницаИзмерения, Коэффициент) Экспорт
	
	Если ТипЗнч(ЕдиницаИзмерения) <> Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
		Возврат ВесИОбъемБазовойЕдиницы(Номенклатура, Коэффициент);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВесИОбъемЕдиницТоваров.Вес,
	|	ВесИОбъемЕдиницТоваров.Объем
	|ИЗ
	|	РегистрСведений.ВесИОбъемЕдиницТоваров КАК ВесИОбъемЕдиницТоваров
	|ГДЕ
	|	ВесИОбъемЕдиницТоваров.Номенклатура = &Номенклатура
	|	И ВесИОбъемЕдиницТоваров.ЕдиницаИзмерения = &ЕдиницаИзмерения");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ВесИОбъемБазовойЕдиницы(Номенклатура, Коэффициент);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат НовыйРезультат(Выборка.Вес, Выборка.Объем);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВесИОбъемБазовойЕдиницы(Номенклатура, Коэффициент)
	
	ВесИОбъемБазовойЕдиницы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "Вес,Объем");
	Возврат НовыйРезультат(ВесИОбъемБазовойЕдиницы.Вес * Коэффициент, ВесИОбъемБазовойЕдиницы.Объем * Коэффициент)
	
КонецФункции

Функция НовыйРезультат(ВесЕдиницыТовара, ОбъемЕдиницыТовара)
	
	Результат = Новый Структура;
	Результат.Вставить("ВесЕдиницыТовара", ВесЕдиницыТовара);
	Результат.Вставить("ОбъемЕдиницыТовара", ОбъемЕдиницыТовара);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
